Config/InformationRegisters/НастройкаСпособовОтраженияЗарплатыВБухУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСпособовОтраженияЗарплатыВБухУчете</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеВУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьВходящиеДанныеЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоответствиеОперацийУчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеОперацийУчетаЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОперацияБГУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийОтраженияЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОперацияЗГУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/НачислениеРезервовПоОтпускам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеРезервовПоОтпускам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОперацииКапвложений</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаОбязательств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортированИзЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Comment>Хранит идентификатор объекта источника при переносе данных из другой системы (например БГУ1)</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОценочныеОбязательства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияЗарплатыВУчете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансированияЗарплата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперацииПоЗарплате</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаетсяЕНВД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчете</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчетеЗаполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчетеДоступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтразитьВКарточкеКапвложений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарточкаКапвложений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/НастройкаСпособовОтраженияЗарплатыВБухУчете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыВыбораСчетНаСервере(МассивВидОперации) Экспорт
	
	ПараметрыВыбораСчета = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СоответствиеОперацийУчетаЗарплаты.ОперацияБГУ.ОграниченияСчет.(
	                      |		Счет КАК Счет
	                      |	) КАК СписокСчетов
	                      |ИЗ
	                      |	РегистрСведений.СоответствиеОперацийУчетаЗарплаты КАК СоответствиеОперацийУчетаЗарплаты
	                      |ГДЕ
	                      |	СоответствиеОперацийУчетаЗарплаты.ОперацияЗГУ В(&ОперацияЗГУ)");
	
	Запрос.УстановитьПараметр("ОперацияЗГУ", МассивВидОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСчетов = Новый Массив;
	
	Если Выборка.Следующий() Тогда
		
		ВыборкаСчет = Выборка.СписокСчетов.Выбрать();
		
		Пока ВыборкаСчет.Следующий() Цикл
			
			МассивСчетов.Добавить(ВыборкаСчет.Счет);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПолучитьОграниченияОперацииРезервовПоОтпускам(МассивВидОперации, МассивСчетов);
	
	Если МассивСчетов.Количество() > 0 Тогда
		
		ПараметрыВыбораСчета.Вставить("ОграниченияСписокСчетов", МассивСчетов);
		
	Иначе
		// по корреспонденции
		ПараметрыВыбораСчета.Вставить("КорреспонденцияКтКод", "302.00");
		
	КонецЕсли;	
	
	Возврат ПараметрыВыбораСчета;
	
КонецФункции

Процедура ПолучитьОграниченияОперацииРезервовПоОтпускам(МассивВидОперации, МассивСчетов)
	
	ТекстМакета = Документы.НачислениеРезервовПоОтпускам.ПолучитьМакет("ОграниченияОпераций").ПолучитьТекст(); 
	ВидыОпераций = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстМакета);
	
	Для Каждого ТекВидОперации Из МассивВидОперации Цикл 
		
		СтрокаОграничений = ВидыОпераций.Найти(ТекВидОперации, "ВидОперацииПоЗарплате");
		
		Если СтрокаОграничений = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Объект.Ссылка КАК Счет
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК Объект
		|ГДЕ
		|	Объект.Код В (&МассивОграничений)
		|УПОРЯДОЧИТЬ ПО
		|	Объект.Код";
		
		Запрос.УстановитьПараметр("МассивОграничений", СтрРазделить(СтрокаОграничений.ОграничениеСчет, ","));
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			
			Если МассивСчетов.Найти(Результат.Счет) = Неопределено Тогда
				МассивСчетов.Добавить(Результат.Счет);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

Функция МассивПараметровВыбораВидаОперации() Экспорт
	МДРегистра = Метаданные.РегистрыСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете;
	
	Возврат МДРегистра.Измерения.ВидОперации.ПараметрыВыбора;
КонецФункции

Процедура УдалитьНаборЗаписей(СтруктураОтбора) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.ВидОперации КАК ВидОперации,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.Период КАК Период,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.Организация КАК Организация,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.КодНалоговогоОргана КАК КодНалоговогоОргана,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете
	               |ИЗ
	               |	РегистрСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете КАК НастройкаСпособовОтраженияЗарплатыВБухУчете
	               |ГДЕ
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.Период = &Период
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете = &СпособОтраженияЗарплатыВБухУчете
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.ВидОперации = &ВидОперации
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.Организация = &Организация
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.КодНалоговогоОргана = &КодНалоговогоОргана
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СчетДт = &СчетДт
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.Субконто1 = &Субконто1
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.Субконто2 = &Субконто2
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.Субконто3 = &Субконто3
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СчетНУ = &СчетНУ
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СубконтоНУ1 = &СубконтоНУ1
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СубконтоНУ2 = &СубконтоНУ2
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СубконтоНУ3 = &СубконтоНУ3
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.ОтражениеВУСН = &ОтражениеВУСН
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.НеИспользоватьВходящиеДанныеЗГУ = &НеИспользоватьВходящиеДанныеЗГУ";

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",								СтруктураОтбора.Период);
	Запрос.УстановитьПараметр("Организация",						СтруктураОтбора.Организация);
	Запрос.УстановитьПараметр("КодНалоговогоОргана",				СтруктураОтбора.КодНалоговогоОргана);
	Запрос.УстановитьПараметр("СпособОтраженияЗарплатыВБухУчете",	СтруктураОтбора.СпособОтраженияЗарплатыВБухУчете);
	Запрос.УстановитьПараметр("ВидОперации",						СтруктураОтбора.ВидОперации);
	Запрос.УстановитьПараметр("СчетДт",								СтруктураОтбора.СчетДт);
	Запрос.УстановитьПараметр("Субконто1",							СтруктураОтбора.Субконто1);
	Запрос.УстановитьПараметр("Субконто2",							СтруктураОтбора.Субконто2);
	Запрос.УстановитьПараметр("Субконто3",							СтруктураОтбора.Субконто3);
	Запрос.УстановитьПараметр("СчетНУ",								СтруктураОтбора.СчетНУ);
	Запрос.УстановитьПараметр("СубконтоНУ1",						СтруктураОтбора.СубконтоНУ1);
	Запрос.УстановитьПараметр("СубконтоНУ2",						СтруктураОтбора.СубконтоНУ2);
	Запрос.УстановитьПараметр("СубконтоНУ3",						СтруктураОтбора.СубконтоНУ3);
	Запрос.УстановитьПараметр("ОтражениеВУСН",						СтруктураОтбора.ОтражениеВУСН);
	Запрос.УстановитьПараметр("НеИспользоватьВходящиеДанныеЗГУ",		СтруктураОтбора.НеИспользоватьВходящиеДанныеЗГУ);
	
	Если Не ЗначениеЗаполнено(СтруктураОтбора.ВидОперации) 
		ИЛИ ТипЗнч(СтруктураОтбора.ВидОперации) = Тип("Строка") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И НастройкаСпособовОтраженияЗарплатыВБухУчете.ВидОперации = &ВидОперации","");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ТВидыОпераций = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТВидыОпераций Цикл
		НаборЗаписейЭталон = РегистрыСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.СоздатьНаборЗаписей();
		НаборЗаписейЭталон.Отбор.Период.Установить(СтрокаТаблицы.Период);
		НаборЗаписейЭталон.Отбор.СпособОтраженияЗарплатыВБухУчете.Установить(СтрокаТаблицы.СпособОтраженияЗарплатыВБухУчете);
		НаборЗаписейЭталон.Отбор.Организация.Установить(СтрокаТаблицы.Организация);
		НаборЗаписейЭталон.Отбор.КодНалоговогоОргана.Установить(СтрокаТаблицы.КодНалоговогоОргана);
		НаборЗаписейЭталон.Отбор.ВидОперации.Установить(СтрокаТаблицы.ВидОперации);
		НаборЗаписейЭталон.Очистить();
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейЭталон);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
